erp3l.Доработка/src/Documents/ллл_ЛогистическаяСделка/ллл_ЛогистическаяСделка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ллл_ЛогистическаяСделка</name>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиПредполагаемая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ллл_СтатусыЛогистическихСделок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРС</name>
    <comment>DT_NO реквизит из РС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыПоставщикам</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриобретениеТоваровУслуг</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПриобретения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредварительныйЗаказВендору</name>
      <type>
        <types>DocumentRef.ллл_ПредварительныйЗаказЗаводуИзготовителю</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПредварительногоЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l.Доработка/src/CommonForms/РаспределениеРасходовНаПоступления/Module.bsl
&НаКлиенте
Процедура ллл_ОбработатьВыборДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		МассивДокументов = ПриобретенияИзСделки(Результат);
		Для Каждого ТекДок Из МассивДокументов Цикл
			НоваяСтрока = СписокДокументов.Добавить();
			НоваяСтрока.АналитикаРасходов = ТекДок;
			Элементы.СписокДокументов.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			СписокДокументовДокументПриИзменении(Неопределено);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриобретенияИзСделки(Результат)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Результат) Тогда
		ТекМассивДок = СписокДокументов.Выгрузить(, "АналитикаРасходов").ВыгрузитьКолонку("АналитикаРасходов");
		Для Каждого ТекСтр Из Результат.ЗаказыПоставщикам Цикл
			Если ЗначениеЗаполнено(ТекСтр.ПриобретениеТоваровУслуг)
				И МассивДокументов.Найти(ТекСтр.ПриобретениеТоваровУслуг) = Неопределено
				И ТекМассивДок.Найти(ТекСтр.ПриобретениеТоваровУслуг) = Неопределено Тогда
				МассивДокументов.Добавить(ТекСтр.ПриобретениеТоваровУслуг);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивДокументов;
	
КонецФункции

&НаКлиенте
Процедура ллл_ПодобратьДокументыПоЛогистическойСделкеПосле(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора",        Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);

	ОповещениеЗакрытия  = Новый ОписаниеОповещения("ллл_ОбработатьВыборДокумента", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ллл_ЛогистическаяСделка.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , ,
		ОповещениеЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры
